(function (factory) {
    "use strict";
    if (typeof define === 'function' && define.amd) {
        define("language/uk_UA", ['bootstrapValidator', 'jquery'], factory);
    }
    else {
        factory($.fn.bootstrapValidator, jQuery);
    }
}(function (bootstrapValidator, $) {

    bootstrapValidator = bootstrapValidator || {};
    /**
     * Default English package. It's included in the dist, so you do NOT need to include it to your head tag
     * The лише reason I put it here is that you can clone it, and translate it into your language
     */
    $.fn.bootstrapValidator.i18n = $.extend(true, $.fn.bootstrapValidator.i18n, {
        base64: {
            'default': 'Будь ласка введіть правильне кодування base 64'
        },
        between: {
            'default': 'Введіть значення між %s та %s включно',
            notInclusive: 'Введіть значення між %s та %s'
        },
        callback: {
            'default': 'Будь ласка введіть правильне значення'
        },
        choice: {
            'default': 'Будь ласка введіть правильне значення',
            less: 'Виберіть %s опцію для мінімуму',
            more: 'Виберіть %s опцію для максимуму',
            between: 'Виберіть опції між %s - %s'
        },
        creditCard: {
            'default': 'Будь ласка введіть правильний номер картки'
        },
        cusip: {
            'default': 'Будь ласка введіть правильне CUSIP число'
        },
        cvv: {
            'default': 'Будь ласка введіть правильне CVV число'
        },
        date: {
            'default': 'Будь ласка введіть правильну дату'
        },
        different: {
            'default': 'Будь ласка введіть інше значення'
        },
        digits: {
             'default': 'Будь ласка введіть лише цифри'
        },
        ean: {
            'default': 'Будь ласка введіть правильне EAN число'
        },
        emailAddress: {
            'default': 'Будь ласка введіть правильну електронну адресу'
        },
        file: {
            'default': 'Виберіть файл'
        },
        greaterThan: {
            'default': 'Будь ласка введіть значення більше/рівне %s',
            notInclusive: 'Будь ласка введіть значення більше ніж %s'
        },
        grid: {
            'default': 'Будь ласка введіть правильне GRId число'
        },
        hex: {
            'default': 'Будь ласка введіть правильне шістнадцяткове число'
        },
        hexColor: {
            'default': 'Будь ласка введіть правильне колір в hex форматі'
        },
        iban: {
            'default': 'Будь ласка введіть правильне IBAN число',
            countryNotSupported: 'Код країни %s не підтримується',
            country: 'Будь ласка введіть правильне IBAN число для %s',
            countries: {
                AD: 'Андори',
                AE: 'ОАЕ',
                AL: 'Албанії',
                AO: 'Анголи',
                AT: 'Австрії',
                AZ: 'Азербайджану',
                BA: 'Боснії та Герцеговини',
                BE: 'Бельгії',
                BF: 'Буркіна-Фасо',
                BG: 'Болгарії',
                BH: 'Бахрейну',
                BI: 'Бурунди',
                BJ: 'Беніну',
                BR: 'Бразилії',
                CH: 'Швейцарії',
                CI: 'Республіка Кот-д\'Івуар',
                CM: 'Камеркні',
                CR: 'Коста Ріки',
                CV: 'Кабо-Верде',
                CY: 'Кіпрі',
                CZ: 'Чеської Республіки',
                DE: 'Німеччини',
                DK: 'Данії',
                DO: 'Домініканській Республіки',
                DZ: 'Алжирії',
                EE: 'Естонії',
                ES: 'Іспанії',
                FI: 'Фінляндії',
                FO: 'Форерські острови',
                FR: 'Франції',
                GB: 'Великобританії',
                GE: 'Грузії',
                GI: 'Гібралтару',
                GL: 'Гринладнії',
                GR: 'Греції',
                GT: 'Гватемали',
                HR: 'Хорватії',
                HU: 'Угорщини',
                IE: 'Ірландії',
                IL: 'Ізраїля',
                IR: 'Ірану',
                IS: 'Ісландії',
                IT: 'Італії',
                JO: 'Йордану',
                KW: 'Кувейту',
                KZ: 'Казахстану',
                LB: 'Лівану',
                LI: 'Ліхтенштейну',
                LT: 'Литви',
                LU: 'Люксембургу',
                LV: 'Латвії',
                MC: 'Монако',
                MD: 'Молодови',
                ME: 'Чорногорії',
                MG: 'Мадагаскару',
                MK: 'Македонії',
                ML: 'Малі',
                MR: 'Мавританії',
                MT: 'Мальти',
                MU: 'Маврикії',
                MZ: 'Мозамбіку',
                NL: 'Нідерладндів',
                NO: 'Норвегії',
                PK: 'Пакистані',
                PL: 'Польщі',
                PS: 'Палестини',
                PT: 'Португалії',
                QA: 'Катару',
                RO: 'Ромунії',
                RS: 'Сербії',
                SA: 'Саудівської Аравії',
                SE: 'Швеції',
                SI: 'Словенії',
                SK: 'Словакії',
                SM: 'Сан Марино',
                SN: 'Сенегалу',
                TN: 'Тунісу',
                TR: 'Туреччині',
                VG: 'Віргінські острови, Британські'
            }
        },
        id: {
            'default': 'Будь ласка введіть правильний id',
            countryNotSupported: 'Код країни %s не підтримується',
            country: 'Будь ласка введіть правильний id для %s',
            countries: {
                BA: 'Боснії та Герцеговини',
                BG: 'Болгарії',
                BR: 'Бразилії',
                CH: 'Швейцарії',
                CL: 'Чилі',
                CZ: 'Чехії',
                DK: 'Данії',
                EE: 'Естонії',
                ES: 'Іспанії',
                FI: 'Фінляндії',
                HR: 'Хорватії',
                IE: 'Ірландії',
                IS: 'Ісландії',
                LT: 'Литви',
                LV: 'Латвії',
                ME: 'Чорногорії',
                MK: 'Македонії',
                NL: 'Голландії',
                RO: 'Ромунії',
                RS: 'Сербії',
                SE: 'Швеції',
                SI: 'Словенії',
                SK: 'Словакії',
                SM: 'Сан Маринно',
                ZA: 'Південної Африки'
            }
        },
        identical: {
            'default': 'Будь ласка введіть те саме значення'
        },
        imei: {
            'default': 'Будь ласка введіть правильне IMEI число'
        },
        imo: {
            'default': 'Будь ласка введіть правильне IMO число'
        },
        integer: {
            'default': 'Будь ласка введіть правильне ціле число'
        },
        ip: {
            'default': 'Будь ласка введіть правильну IP адресу',
            ipv4: 'Будь ласка введіть правильну IPv4 адресу',
            ipv6: 'Будь ласка введіть правильну IPv6 адресу'
        },
        isbn: {
            'default': 'Будь ласка введіть правильний ISBN'
        },
        isin: {
            'default': 'Будь ласка введіть правильний ISIN'
        },
        ismn: {
            'default': 'Будь ласка введіть правильний ISMN'
        },
        issn: {
            'default': 'Будь ласка введіть правильний ISSN'
        },
        lessThan: {
            'default': 'Будь ласка введіть значення меньше або рівне %s',
            notInclusive: 'Будь ласка введіть меньше ніж %s'
        },
        mac: {
            'default': 'Будь ласка введіть правильну MAC адресу'
        },
        meid: {
            'default': 'Будь ласка введіть правильний MEID'
        },
        notEmpty: {
            'default': 'Будь ласка заповніть поле'
        },
        numeric: {
            'default': 'Будь ласка введіть правильне дійсне число'
        },
        phone: {
            'default': 'Будь ласка введіть правильний телефон',
            countryNotSupported: 'Код країни %s не підтримується',
            country: 'Будь ласка введіть правильний телефон в %s',
            countries: {
                ES: 'Іспанії',
                FR: 'Франції',
                GB: 'Великобританії',
                US: 'США'
            }
        },
        regexp: {
            'default': 'Будь ласка введіть значення, що задовільняє умову'
        },
        remote: {
            'default': 'Будь ласка введіть правильне значення'
        },
        rtn: {
            'default': 'Будь ласка введіть правильне RTN число'
        },
        sedol: {
            'default': 'Будь ласка введіть правильне SEDOL число'
        },
        siren: {
            'default': 'Будь ласка введіть правильне SIREN число'
        },
        siret: {
            'default': 'Будь ласка введіть правильне SIRET число'
        },
        step: {
            'default': 'Будь ласка введіть правильний крок %s'
        },
        stringCase: {
            'default': 'Будь ласка введіть всі символи тільки нижнього регістру',
            upper: 'Будь ласка введіть всі символи тільки верхнього регістру'
        },
        stringLength: {
            'default': 'Будь ласка введіть значення відповідної довжини',
            less: 'Будь ласка введіть меньше ніж %s символів',
            more: 'Будь ласка введіть бліьше ніж %s символів',
            between: 'Будь ласка введіть значення довжина якого є між %s та %s'
        },
        uri: {
            'default': 'Будь ласка введіть правильне URI'
        },
        uuid: {
            'default': 'Будь ласка введіть правильне UUID число',
            version: 'Будь ласка введіть правильну версію UUID %s'
        },
        vat: {
            'default': 'Будь ласка введіть правильне VAT число',
            countryNotSupported: 'Код країни %s не підтримується',
            country: 'Будь ласка введіть правильний %s VAT',
            countries: {
                AT: 'Австрійський',
                BE: 'Бельгійський',
                BG: 'Болгарський',
                CH: 'Швейсарський',
                CY: 'Кіпрський',
                CZ: 'Чеський',
                DE: 'Німецький',
                DK: 'Данський',
                EE: 'Естонський',
                ES: 'Іспанський',
                FI: 'Фінський',
                FR: 'Французький',
                GB: 'Великобританський',
                GR: 'Грецький',
                EL: 'Грецький',
                HU: 'Угорський',
                HR: 'Хорватський',
                IE: 'Ірландський',
                IT: 'Італійський',
                LT: 'Литовський',
                LU: 'Люксембургський',
                LV: 'Латвійський',
                MT: 'Мальтійський',
                NL: 'Датський',
                NO: 'Норвежський',
                PL: 'Польский',
                PT: 'Португальський',
                RO: 'Ромунський',
                RU: 'Російський',
                RS: 'Сербський',
                SE: 'Швейцарський',
                SI: 'Словенський',
                SK: 'Словацький',
                ZA: 'Південно-Африканський'
            }
        },
        vin: {
            'default': 'Будь ласка введіть правильне VIN число'
        },
        zipCode: {
            'default': 'Будь ласка введіть правильний zip-код',
            countryNotSupported: 'Код країни %s не підтримується',
            country: 'Будь ласка введіть правильний поштовий індекс для %s',
            countries: {
                CA: 'Канади',
                DK: 'Німеччини',
                GB: 'Великобританії',
                IT: 'Італії',
                NL: 'Данії',
                SE: 'Швейцарії',
                SG: 'Сингапуру',
                US: 'США'
            }
        }
    });

    return bootstrapValidator.i18n;
}));